-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- 생성 시간: 24-12-21 09:43
-- 서버 버전: 10.4.32-MariaDB
-- PHP 버전: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 데이터베이스: `quantumcode`
--

-- --------------------------------------------------------

--
-- 테이블 구조 `lecture_video`
--

CREATE TABLE `lecture_video` (
  `lvid` int(11) NOT NULL COMMENT '강의영상 고유번호',
  `lid` int(11) NOT NULL COMMENT '연결된 강의 고유번호',
  `t_id` varchar(20) NOT NULL COMMENT '강사 아이디',
  `video_lecture` varchar(100) NOT NULL COMMENT '강의 영상 파일경로',
  `video_title` varchar(55) DEFAULT NULL COMMENT '강의 제목',
  `video_duration` varchar(50) NOT NULL COMMENT '영상 시간',
  `regdate` datetime NOT NULL DEFAULT current_timestamp() COMMENT '등록 시간'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='강의 영상 테이블';

--
-- 테이블의 덤프 데이터 `lecture_video`
--

INSERT INTO `lecture_video` (`lvid`, `lid`, `t_id`, `video_lecture`, `video_title`, `video_duration`, `regdate`) VALUES
(114, 120, 'admin', '/qc/admin/upload/20241221091324209267.mp4', '코어 자바스크립트 1강', '00:00:16', '2024-12-21 17:13:24'),
(115, 120, 'admin', '/qc/admin/upload/20241221091324619024.mp4', '코어 자바스크립트 2강', '00:00:41', '2024-12-21 17:13:24'),
(116, 119, 'admin', '/qc/admin/upload/20241221091415149014.mp4', '웹 프론트엔드를 위한 자바스크립트 첫걸음 1강', '00:00:16', '2024-12-21 17:14:15'),
(117, 119, 'admin', '/qc/admin/upload/20241221091415166488.mp4', '웹 프론트엔드를 위한 자바스크립트 첫걸음 2강', '00:00:41', '2024-12-21 17:14:15'),
(118, 124, 'admin', '/qc/admin/upload/20241221091458114822.mp4', '시작하기 ', '00:00:16', '2024-12-21 17:14:58'),
(119, 124, 'admin', '/qc/admin/upload/20241221091458707699.mp4', '마무리', '00:00:41', '2024-12-21 17:14:58'),
(120, 130, 'admin', '/qc/admin/upload/20241221091546941745.mp4', '프로젝트로', '00:00:16', '2024-12-21 17:15:46'),
(121, 130, 'admin', '/qc/admin/upload/20241221091546179479.mp4', '배워봅니다', '00:00:41', '2024-12-21 17:15:46'),
(122, 140, 'admin', '/qc/admin/upload/20241221091639133183.mp4', '비전공자도 할 수 있는 이유', '00:00:16', '2024-12-21 17:16:39'),
(123, 140, 'admin', '/qc/admin/upload/20241221091639308649.mp4', 'MySql', '00:00:41', '2024-12-21 17:16:39'),
(124, 125, 'admin', '/qc/admin/upload/20241221091720107426.mp4', '만들면서', '00:00:12', '2024-12-21 17:17:20'),
(125, 125, 'admin', '/qc/admin/upload/20241221091720195679.mp4', '배워봅니다', '00:00:31', '2024-12-21 17:17:20'),
(126, 125, 'admin', '/qc/admin/upload/20241221091720208354.mp4', '리액트를', '00:00:10', '2024-12-21 17:17:20'),
(127, 137, 'admin', '/qc/admin/upload/20241221091816425664.mp4', '코딩을 배워야 하는 이유', '00:00:16', '2024-12-21 17:18:16'),
(128, 137, 'admin', '/qc/admin/upload/20241221091816208087.mp4', '어렵지 않습니다', '00:00:41', '2024-12-21 17:18:16'),
(129, 142, 'admin', '/qc/admin/upload/20241221092011147421.mp4', 'Redis는...', '00:00:31', '2024-12-21 17:20:11'),
(130, 142, 'admin', '/qc/admin/upload/20241221092011204675.mp4', '우리는 이렇게 배워요', '00:00:16', '2024-12-21 17:20:11'),
(131, 126, 'admin', '/qc/admin/upload/20241221092104207732.mp4', '시작하기 앞서...', '00:00:31', '2024-12-21 17:21:04'),
(132, 126, 'admin', '/qc/admin/upload/20241221092104169800.mp4', '문법', '00:00:10', '2024-12-21 17:21:04'),
(133, 126, 'admin', '/qc/admin/upload/20241221092104139064.mp4', '반복문', '00:00:16', '2024-12-21 17:21:04'),
(134, 133, 'admin', '/qc/admin/upload/20241221092140199027.mp4', 'Node.js는', '00:00:12', '2024-12-21 17:21:40'),
(135, 133, 'admin', '/qc/admin/upload/20241221092140638911.mp4', '이런 강의를 합니다', '00:00:31', '2024-12-21 17:21:40'),
(136, 133, 'admin', '/qc/admin/upload/20241221092140937266.mp4', 'Node.js 사용법', '00:00:10', '2024-12-21 17:21:40'),
(137, 138, 'admin', '/qc/admin/upload/20241221092505187888.mp4', '실무에서 쓰는 자바란', '00:00:24', '2024-12-21 17:25:05'),
(138, 138, 'admin', '/qc/admin/upload/20241221092505883293.mp4', '객체지향', '00:00:10', '2024-12-21 17:25:05'),
(139, 138, 'admin', '/qc/admin/upload/20241221092505708451.mp4', '스프링', '00:00:41', '2024-12-21 17:25:05'),
(140, 141, 'admin', '/qc/admin/upload/20241221092603312165.mp4', '스타트업에서 선호하는 이유', '00:00:24', '2024-12-21 17:26:03'),
(141, 141, 'admin', '/qc/admin/upload/20241221092603181818.mp4', '파이썬 기초', '00:00:10', '2024-12-21 17:26:03'),
(142, 141, 'admin', '/qc/admin/upload/20241221092603183355.mp4', '몽고 DB', '00:00:16', '2024-12-21 17:26:03'),
(143, 123, 'admin', '/qc/admin/upload/20241221092639962429.mp4', '웹 기초', '00:00:12', '2024-12-21 17:26:39'),
(144, 123, 'admin', '/qc/admin/upload/20241221092639158663.mp4', '자바스크립트 기초', '00:00:31', '2024-12-21 17:26:39'),
(145, 128, 'admin', '/qc/admin/upload/20241221092711103701.mp4', '강의 진행 과정', '00:00:31', '2024-12-21 17:27:11'),
(146, 128, 'admin', '/qc/admin/upload/20241221092711914657.mp4', '기초 문법', '00:00:10', '2024-12-21 17:27:11'),
(147, 144, 'admin', '/qc/admin/upload/20241221092821104787.mp4', '각광받는 쿠버네티스', '00:00:24', '2024-12-21 17:28:21'),
(148, 144, 'admin', '/qc/admin/upload/20241221092821999762.mp4', '왜 쿠버네티스인가', '00:00:10', '2024-12-21 17:28:21'),
(149, 121, 'admin', '/qc/admin/upload/20241221092852944502.mp4', '자바스크립트로 할 수 있는 것들', '00:00:31', '2024-12-21 17:28:52'),
(150, 121, 'admin', '/qc/admin/upload/20241221092852131767.mp4', '자바스크립트 기초', '00:00:10', '2024-12-21 17:28:52'),
(151, 131, 'admin', '/qc/admin/upload/20241221092950268079.mp4', '트렐로가 뭔가요?', '00:00:12', '2024-12-21 17:29:50'),
(152, 131, 'admin', '/qc/admin/upload/20241221092950109599.mp4', 'Vue.js 기초', '00:00:31', '2024-12-21 17:29:50'),
(153, 131, 'admin', '/qc/admin/upload/20241221092950101380.mp4', 'Vue-Router', '00:00:16', '2024-12-21 17:29:50'),
(154, 127, 'admin', '/qc/admin/upload/20241221093051164192.mp4', 'WebAssembly 란?', '00:00:31', '2024-12-21 17:30:51'),
(155, 127, 'admin', '/qc/admin/upload/20241221093051109304.mp4', 'Web 개발 기초 강의', '00:00:10', '2024-12-21 17:30:51'),
(156, 139, 'admin', '/qc/admin/upload/20241221093126177680.mp4', 'Go 언어는', '00:00:31', '2024-12-21 17:31:26'),
(157, 139, 'admin', '/qc/admin/upload/20241221093126823047.mp4', '간결한 문법', '00:00:16', '2024-12-21 17:31:26'),
(158, 143, 'admin', '/qc/admin/upload/20241221093209458485.mp4', '풀스택 강의', '00:00:24', '2024-12-21 17:32:09'),
(159, 143, 'admin', '/qc/admin/upload/20241221093209139229.mp4', '최신 서버 기술', '00:00:10', '2024-12-21 17:32:09'),
(160, 132, 'admin', '/qc/admin/upload/20241221093249200091.mp4', '사주 만세력', '00:00:24', '2024-12-21 17:32:49'),
(161, 132, 'admin', '/qc/admin/upload/20241221093249190300.mp4', '백엔드 API', '00:00:10', '2024-12-21 17:32:49'),
(162, 118, 'admin', '/qc/admin/upload/20241221093430693428.mp4', '저는 현업 개발자', '00:00:12', '2024-12-21 17:34:30'),
(163, 118, 'admin', '/qc/admin/upload/20241221093430321745.mp4', '코알못도 할 수 있다', '00:00:31', '2024-12-21 17:34:30'),
(164, 135, 'admin', '/qc/admin/upload/20241221093510212266.mp4', 'PHP', '00:00:12', '2024-12-21 17:35:10'),
(165, 135, 'admin', '/qc/admin/upload/20241221093510111845.mp4', 'MySql', '00:00:41', '2024-12-21 17:35:10'),
(166, 116, 'admin', '/qc/admin/upload/20241221093540950926.mp4', 'HTTP 핵심 기능', '00:00:16', '2024-12-21 17:35:40'),
(167, 116, 'admin', '/qc/admin/upload/20241221093540318137.mp4', ' HTTP API 설계 방법', '00:00:41', '2024-12-21 17:35:40'),
(168, 117, 'admin', '/qc/admin/upload/20241221093558177955.mp4', '구조적 이해', '00:00:12', '2024-12-21 17:35:58'),
(169, 117, 'admin', '/qc/admin/upload/20241221093558569970.mp4', '반복 학습', '00:00:16', '2024-12-21 17:35:58'),
(170, 134, 'admin', '/qc/admin/upload/20241221093735771315.mp4', '기획', '00:00:12', '2024-12-21 17:37:35'),
(171, 134, 'admin', '/qc/admin/upload/20241221093735147282.mp4', '활용개념', '00:00:31', '2024-12-21 17:37:35'),
(172, 134, 'admin', '/qc/admin/upload/20241221093735597324.mp4', '기초', '00:00:16', '2024-12-21 17:37:35'),
(173, 136, 'admin', '/qc/admin/upload/20241221093907391165.mp4', '왜 쓰는 걸까요', '00:00:12', '2024-12-21 17:39:07'),
(174, 136, 'admin', '/qc/admin/upload/20241221093907792500.mp4', '프레임워크', '00:00:31', '2024-12-21 17:39:07');

--
-- 덤프된 테이블의 인덱스
--

--
-- 테이블의 인덱스 `lecture_video`
--
ALTER TABLE `lecture_video`
  ADD PRIMARY KEY (`lvid`);

--
-- 덤프된 테이블의 AUTO_INCREMENT
--

--
-- 테이블의 AUTO_INCREMENT `lecture_video`
--
ALTER TABLE `lecture_video`
  MODIFY `lvid` int(11) NOT NULL AUTO_INCREMENT COMMENT '강의영상 고유번호', AUTO_INCREMENT=175;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
